
. /* ssc install clustergram */
. use vgsales.dta, clear

. describe

Contains data from vgsales.dta
  obs:        16,598                          
 vars:            17                          23 Apr 2020 18:38
 size:     3,784,344                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
rank            int     %8.0g                 Rank
name            str132  %132s                 Name
platform        str4    %9s                   Platform
year            str4    %9s                   Year
year_i          int     %10.0g                Year
genre           str12   %12s                  Genre
publisher       str38   %38s                  Publisher
na_sales        float   %9.0g                 NA_Sales
eu_sales        float   %9.0g                 EU_Sales
jp_sales        float   %9.0g                 JP_Sales
other_sales     float   %9.0g                 Other_Sales
global_sales    float   %9.0g                 Global_Sales
genre_i         long    %12.0g     genre_i    Genre
pub_i           long    %38.0g     pub_i      Publisher
plat_i          long    %8.0g      plat_i     Platform
plat_gen        byte    %8.0g                 
plat_type       byte    %8.0g                 
-------------------------------------------------------------------------------
Sorted by: plat_i

. egen z_eu_sales = std(eu_sales)

. egen z_jp_sales = std(jp_sales)

. egen z_na_sales = std(na_sales)

. egen z_other_sales = std(other_sales)

. egen z_global_sales = std(global_sales)

. egen z_year_i = std(year_i)
(271 missing values generated)

. egen z_rank = std(rank)

. cluster singlelinkage z_eu_sales z_jp_sales z_na_sales  z_year_i z_rank, meas
> ure(L2) name(myclust)

. cluster stop myclust, rule(calinski) 

+---------------------------+
|             |  Calinski/  |
|  Number of  |  Harabasz   |
|  clusters   |  pseudo-F   |
|-------------+-------------|
|      2      |   1274.18   |
|      3      |    763.97   |
|      4      |    731.99   |
|      5      |    650.90   |
|      6      |    524.14   |
|      7      |    733.57   |
|      8      |    672.48   |
|      9      |    605.73   |
|     10      |    544.56   |
|     11      |    493.28   |
|     12      |    483.45   |
|     13      |    466.48   |
|     14      |    431.70   |
|     15      |    401.96   |
+---------------------------+

. cluster kmeans z_eu_sales z_jp_sales z_na_sales  z_year_i z_rank, k(2) measur
> e(L2) name(kclust)

. cluster kmeans z_eu_sales z_jp_sales z_na_sales  z_year_i z_rank, k(4) measur
> e(L2) name(kclust4)

. twoway (scatter rank year_i if kclust==1, mcolor("green") ) (scatter rank yea
> r_i if kclust==2, mcolor("red")),legend(off)

. twoway (scatter rank year_i if kclust4==1, mcolor("green")) (scatter rank yea
> r_i if kclust4==2, mcolor("red")) (scatter rank year_i if kclust4==3, mcolor(
> "blue")) (scatter rank year_i if kclust4==4, mcolor("yellow")),legend(off)

. 
end of do-file
